docs/comp-sci/sml/string-stream.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>StringStream - SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">StringStream - SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-e4bbaadc-b46b-4d44-b5bb-a2177a7a5318">1. Introduction</a>
<ul>
<li><a href="#h-3708155b-2b2f-4cc5-886c-28940959cbae">1.1. String reader</a></li>
<li><a href="#h-ef6933da-a434-40e2-b67e-f08e2c1337dd">1.2. String writer</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-e4bbaadc-b46b-4d44-b5bb-a2177a7a5318" class="outline-2">
<h2 id="h-e4bbaadc-b46b-4d44-b5bb-a2177a7a5318"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-e4bbaadc-b46b-4d44-b5bb-a2177a7a5318">
<p>
For debugging purposes, it's useful to have a way to use a string as
an input stream instead of a file.
</p>

<p>
It's also useful to have a "string writer" (analogous to Java's
<code>StringStream</code>) for building up a string.
</p>
</div>
<div id="outline-container-h-3708155b-2b2f-4cc5-886c-28940959cbae" class="outline-3">
<h3 id="h-3708155b-2b2f-4cc5-886c-28940959cbae"><span class="section-number-3">1.1.</span> String reader</h3>
<div class="outline-text-3" id="text-h-3708155b-2b2f-4cc5-886c-28940959cbae">
<p>
We would create a <code>TextPrimIO.reader</code> object, something like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">mk_string_reader</span> (source : string) : TextPrimIO.reader =
  <span class="org-keyword">let</span>
    <span class="org-keyword">val</span> <span class="org-variable-name">pos</span> = ref 0;
    <span class="org-keyword">fun</span> <span class="org-function-name">read</span> n =
      <span class="org-keyword">let</span>
        <span class="org-keyword">val</span> <span class="org-variable-name">p</span> = !pos;
        <span class="org-keyword">val</span> <span class="org-variable-name">m</span> = min(n, size source - p);
      <span class="org-keyword">in</span>
        pos := p + m;
        substring(source, p, m)
      <span class="org-keyword">end</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">name</span> = <span class="org-string">"&lt;string \""</span> ^
               (<span class="org-keyword">if</span> size source &lt;= 8
                <span class="org-keyword">then</span> source
                <span class="org-keyword">else</span> (substring(source, 0, 8) ^<span class="org-string">"..."</span>)) ^
               <span class="org-string">"\"&gt;"</span>;
  <span class="org-keyword">in</span>
    TextPrimIO.RD{name = name,
                  chunkSize = size source,
                  readVec = SOME(read),
                  readArr = NONE,
                  readVecNB = SOME(<span class="org-keyword">fn</span> n =&gt; SOME(read n)),
                  readArrNB = NONE,
                  block = SOME(<span class="org-keyword">fn</span> () =&gt; ()),
                  canInput = SOME(<span class="org-keyword">fn</span> () =&gt; true),
                  avail = SOME(<span class="org-keyword">fn</span> () =&gt; size source - !pos),
                  getPos = SOME(<span class="org-keyword">fn</span> () =&gt; !pos),
                  setPos = SOME(<span class="org-keyword">fn</span> k =&gt;
                               <span class="org-keyword">if</span> 0 &lt;= k <span class="org-keyword">andalso</span> k &lt;= size sou<span class="org-highlight-beyond-fill-column">rce</span>
                               <span class="org-keyword">then</span> pos := k
                               <span class="org-keyword">else</span> <span class="org-keyword">raise</span> Fail <span class="org-string">"position out o</span><span class="org-string"><span class="org-highlight-beyond-fill-column">f bounds"</span></span><span class="org-highlight-beyond-fill-column">),</span>
                  verifyPos = NONE,
                  close = (<span class="org-keyword">fn</span> () =&gt; ()),
                  ioDesc = NONE}
  <span class="org-keyword">end</span>;
</pre>
</div>

<p>
This can be found in, e.g., section 8.3 of Andrew W Appel's
<a href="https://smlfamily.github.io/history/io.95-02-06.pdf">Proposed interface for Standard ML Stream I/O</a> (dated February 6, 1995).
</p>

<p>
If we wish to adhere to the <a href="https://smlfamily.github.io/Basis/prim-io.html#SIG:PRIM_IO.reader:TY">Standard Basis documentation</a> more
faithfully, we should have a way to check if the stream was
closed. Something like:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> <span class="org-function-name">mk_string_reader</span> (source : string) : TextPrimIO.reader =
  <span class="org-keyword">let</span>
    <span class="org-keyword">val</span> <span class="org-variable-name">pos</span> = ref 0;
    <span class="org-keyword">val</span> <span class="org-variable-name">is_closed</span> = ref false;
    <span class="org-keyword">fun</span> <span class="org-function-name">read</span> n =
      <span class="org-keyword">if</span> !is_closed <span class="org-keyword">then</span> <span class="org-keyword">raise</span> IO.ClosedStream
      <span class="org-keyword">else</span>
        <span class="org-keyword">let</span>
          <span class="org-keyword">val</span> <span class="org-variable-name">p</span> = !pos;
          <span class="org-keyword">val</span> <span class="org-variable-name">m</span> = min(n, size source - p);
        <span class="org-keyword">in</span>
          pos := p + m;
          substring(source, p, m)
        <span class="org-keyword">end</span>;
    <span class="org-keyword">val</span> <span class="org-variable-name">name</span> = <span class="org-string">"&lt;string \""</span> ^
               (<span class="org-keyword">if</span> size source &lt;= 8
                <span class="org-keyword">then</span> source
                <span class="org-keyword">else</span> (substring(source, 0, 8) ^<span class="org-string">"..."</span>)) ^
               <span class="org-string">"\"&gt;"</span>;
  <span class="org-keyword">in</span>
    TextPrimIO.RD{name = name,
                  chunkSize = size source,
                  readVec = SOME(read),
                  readArr = NONE,
                  readVecNB = SOME(<span class="org-keyword">fn</span> n =&gt; SOME(read n)),
                  readArrNB = NONE,
                  block = SOME(<span class="org-keyword">fn</span> () =&gt; ()),
                  canInput = SOME(<span class="org-keyword">fn</span> () =&gt; !is_closed),
                  avail = SOME(<span class="org-keyword">fn</span> () =&gt;
                                  <span class="org-keyword">if</span> !is_closed
                                  <span class="org-keyword">then</span> <span class="org-keyword">raise</span> IO.ClosedStream
                                  <span class="org-keyword">else</span> size source - !pos),
                  getPos = SOME(<span class="org-keyword">fn</span> () =&gt; !pos),
                  setPos = SOME(<span class="org-keyword">fn</span> k =&gt;
                               <span class="org-keyword">if</span> !is_closed
                               <span class="org-keyword">then</span> <span class="org-keyword">raise</span> IO.ClosedStream
                               <span class="org-keyword">else</span> <span class="org-keyword">if</span> 0 &lt;= k <span class="org-keyword">andalso</span> k &lt;= siz<span class="org-highlight-beyond-fill-column">e source</span>
                               <span class="org-keyword">then</span> pos := k
                               <span class="org-keyword">else</span> <span class="org-keyword">raise</span> Fail <span class="org-string">"position out o</span><span class="org-string"><span class="org-highlight-beyond-fill-column">f bounds"</span></span><span class="org-highlight-beyond-fill-column">),</span>
                  verifyPos = NONE,
                  close = (<span class="org-keyword">fn</span> () =&gt; is_closed := true),
                  ioDesc = NONE}
  <span class="org-keyword">end</span>;
</pre>
</div>

<p>
We then have a "smart constructor" to make this an appropriate input
stream type:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> stringReader(source : string) =
  <span class="org-keyword">let</span>
    <span class="org-keyword">val</span> <span class="org-variable-name">reader</span> : TextIO.StreamIO.reader = mk_string_reader sou<span class="org-highlight-beyond-fill-column">rce;</span>
  <span class="org-keyword">in</span>
    TextIO.StreamIO.mkInstream(reader, <span class="org-string">""</span>)
  <span class="org-keyword">end</span>;
</pre>
</div>

<p>
Ostensibly, we can use the result when trying to invoke
<code>TextIO.StramIO.input1</code>. 
</p>
</div>
</div>
<div id="outline-container-h-ef6933da-a434-40e2-b67e-f08e2c1337dd" class="outline-3">
<h3 id="h-ef6933da-a434-40e2-b67e-f08e2c1337dd"><span class="section-number-3">1.2.</span> String writer</h3>
<div class="outline-text-3" id="text-h-ef6933da-a434-40e2-b67e-f08e2c1337dd">
<p>
I found myself looking for something analogous to Java's <code>StringStream</code>,
when writing things out.
</p>

<p>
First, we need to construct a <code>TextPrimIO.writer</code> for the
stream, which will just write to a <code>string ref</code> buffer. This is the
lowest level to Standard ML's I/O model (hence the <code>TextPrimIO</code>
implements the <code>PRIM_IO</code> signature).
</p>

<p>
We do not need to make the string buffer block upon writing to it, at
least I don't think so. A minimal implementation just requires the
<code>writeVec</code> to write to a string buffer. For our purposes, a "string
buffer" is a reference to a string; "writing to it" amounts to updating
the reference by appending to it.
</p>

<p>
On SML/NJ, it seems that only <code>writeVec'</code> is needed for an unbuffered
string stream. MLton also appears to only require <code>writeVec'</code>. I should
really test this on other implementations&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-comment-delimiter">(*</span>
<span class="org-comment">Creates a string writer, which writes to the supplied string b</span><span class="org-comment"><span class="org-highlight-beyond-fill-column">uffer.</span></span>

<span class="org-comment">@param: buffer is the underlying string reference which accumu</span><span class="org-comment"><span class="org-highlight-beyond-fill-column">lates</span></span>
<span class="org-comment">        everything the writer writes.</span>

<span class="org-comment">@see: https://smlfamily.github.io/Basis/prim-io.html#SIG:PRIM_</span><span class="org-comment"><span class="org-highlight-beyond-fill-column">IO.writer:TY</span></span>
<span class="org-comment">@see: https://smlfamily.github.io/Basis/mono-array-slice.html</span>
<span class="org-comment">@see: https://smlfamily.github.io/Basis/mono-array.html</span>
<span class="org-comment-delimiter">*)</span>
<span class="org-keyword">fun</span> stringWriter(buffer : string ref) : TextPrimIO.writer =
  <span class="org-keyword">let</span>
    <span class="org-keyword">fun</span> <span class="org-function-name">writeVec'</span> (v : TextPrimIO.vector_slice)
      = (buffer := (!buffer)^(CharVectorSlice.vector v);
         (CharVectorSlice.length v))
    <span class="org-keyword">fun</span> <span class="org-function-name">writeArr'</span> (arr : TextPrimIO.array_slice)
      = (buffer:=(!buffer)^(CharArraySlice.vector arr);
         (CharArraySlice.length arr))
    <span class="org-keyword">fun</span> <span class="org-function-name">writeVecNB'</span> (v : TextPrimIO.vector_slice)
      = (buffer := (!buffer)^(CharVectorSlice.vector v);
         SOME (CharVectorSlice.length v))
    <span class="org-keyword">fun</span> <span class="org-function-name">writeArrNB'</span> (arr : TextPrimIO.array_slice)
      = (buffer:=(!buffer)^(CharArraySlice.vector arr);
         SOME (CharArraySlice.length arr))
    <span class="org-keyword">fun</span> <span class="org-function-name">closing</span> () = print (<span class="org-string">"Trying to close string stream?!?!</span><span class="org-string"><span class="org-highlight-beyond-fill-column">?\n\n"</span></span><span class="org-highlight-beyond-fill-column">)</span>
  <span class="org-keyword">in</span>
    TextPrimIO.WR{
      name = <span class="org-string">"&lt;string&gt;"</span>,
      chunkSize = 1,
      writeVec = SOME writeVec',
      writeArr = SOME writeArr',
      writeVecNB = SOME writeVecNB',
      writeArrNB = SOME writeArrNB',
      block = NONE,
      canOutput = NONE,
      getPos = NONE,
      setPos = NONE,
      endPos = NONE,
      verifyPos = NONE,
      close = closing,
      ioDesc = NONE}
  <span class="org-keyword">end</span>;
</pre>
</div>

<p>
Now, the Standard ML I/O model has a stream <a href="https://en.wikipedia.org/wiki/Facade_pattern">"facade"</a> (if I may
borrow such an anachronistic term) wrapping around a
"primitive" <code>writer</code> object. We use an <code>outstream</code> when invoking
<code>TextIO.output</code>, in order to write to the stream. We will have
<code>IO.NO_BUF</code> mode for our string output stream, meaning we write directly
to the writer without buffering (thus no need for "flushing" the
stream). 
</p>

<p>
We have a smart constructor for a "string stream" from a "string
writer":
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">fun</span> stringStream(buffer : string ref) =
  <span class="org-keyword">let</span>
    <span class="org-keyword">val</span> <span class="org-variable-name">writer</span> : TextIO.StreamIO.writer = stringWriter(buffer)
  <span class="org-keyword">in</span>
    TextIO.StreamIO.mkOutstream(writer, IO.NO_BUF)
  <span class="org-keyword">end</span>;
</pre>
</div>

<p>
Now we can show an example usage:
</p>

<div class="org-src-container">
<pre class="src src-sml"><span class="org-keyword">val</span> <span class="org-variable-name">b1</span> : string ref = ref <span class="org-string">""</span>;
<span class="org-keyword">val</span> <span class="org-variable-name">ss1</span> = stringStream(b1);

<span class="org-keyword">fun</span> <span class="org-function-name">ss_print</span> (s : string) =
  <span class="org-keyword">let</span>
    <span class="org-keyword">val</span> <span class="org-variable-name">cv</span> : CharVector.vector = s
  <span class="org-keyword">in</span>
    TextIO.StreamIO.output(ss1, cv)
  <span class="org-keyword">end</span>;

ss_print(<span class="org-string">"foobar"</span>);

print(<span class="org-string">"\n\n!b1 = "</span>^(!b1)^<span class="org-string">"\n\n"</span>);
    
<span class="org-comment-delimiter">(* </span><span class="org-comment">then `!b1` evaluates to "foobar"</span><span class="org-comment-delimiter"> *)</span>
</pre>
</div>

<p>
Another approach to constructing a string stream would be to have its
buffer be a reference to a list of strings, but this would be mildly
inefficient since it'd be a stack (and thus a <code>reverse</code> would be needed
to make the order correct).</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Fri, 4 Jul 2025 12:32:40 -0700
</div>
</body>
</html>
